brew "bat"
brew "cmake"
brew "fastfetch"
brew "fzf"
brew "git"
brew "git-bug"
brew "helix"
brew "lazygit"
brew "pgvector"
brew "postgresql@18", restart_service: :changed
brew "python@3.14"
brew "tmux"
brew "uv"
brew "watch"
brew "zsh-autosuggestions"
cask "git-credential-manager"
cask "kitty"
cask "localsend"
vscode "anysphere.cursorpyright"
vscode "jasew.vscode-helix-emulation"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "zhuangtongfa.material-theme"
go "golang.org/x/tools/gopls"
cargo "walked"
uv "basedpyright"
uv "ruff"
